"""
ФИО
На вход программе подаются три строки: имя, фамилия и отчество (именно в таком порядке).
Напишите программу, которая выводит инициалы человека.
"""
a, b, c = input(), input(), input()
print(b[0], a[0], c[0], sep="")
