"""
Decimal to Binary
На вход программе подается натуральное число, записанное в десятичной системе счисления.
Напишите программу,которая переводит данное число в двоичную систему счисления.
"""
s = int(input())
s = format(s, 'b')
print(s)