"""
Цвет настроения синий
Напишите программу, которая считывает одну строку, после чего выводит «YES», если во введенной
строке есть подстрока «синий» и «NO» - в противном случае.
"""
s = input()
if "синий" in s:
    print("YES")
else:
    print("NO")
