"""
Напишите программу, которая считывает длины двух катетов в прямоугольном
треугольнике и выводит его площадь.
"""
a, b = float(input()), float(input())
s = 0.5 * a * b
print(s)
