"""
Абсолютная сумма.
Дано 5 чисел. Напишите программу, которая вычисляет сумму их модулей
"""
a, b, c, d, e = float(input()), float(input()), float(input()), float(input()), float(input())
res = abs(a) + abs(b) + abs(c) + abs(d) + abs(e)
print(res)
