"""
451 градус по Фаренгейту
У известного американского писателя Рэя Бредбери есть роман «451 градус по
Фаренгейту». Напишите программу, которая определяет, какой температуре по шкале
Цельсия соответствует указанное значение по шкале Фаренгейта.
"""

temp = float(input())
res = 5 / 9 * (temp - 32)
print(res)
