"""
Дробная часть
Дано положительное действительное число. Выведите его дробную часть.
"""
n = float(input())
res = n - int(n)
print(res)
