"""
Напишите программу, вычисляющую объем куба и площадь его полной поверхности по введенному значению длины ребра.
"""


dlinna = int(input())
print("Объем = ", dlinna**3, sep="")
print("Площадь полной поверхности = ", 6*(dlinna**2), sep="")
