"""
Напишите программу, которая определяет, является число четным или нечетным.
"""

print("Четное" if int(input()) % 2 == 0 else "Нечетное")
