"""
max и min
Дано натуральное число n,(n≥10). Напишите программу, которая определяет его максимальную и минимальную цифры.
"""
n = input()
print("Максимальная цифра равна", max(n))
print("Минимальная цифра равна", min(n))
